;******************************************************************************
;Free386 APIサンプル
;				'ABK project' all left reserved. This is 'PDS'
;******************************************************************************
;
;　　2001/03/05　製作開始
;
;[TAB=8]

%include	"nasm_abk.h"	;NASM用ヘッダ
%include	"macro.asm"	;マクロ
%include	"f386alib.inc"	;API 作成用ライブラリヘッダ

code	segment para public 'CODE' use32
;******************************************************************************
;■コード
;******************************************************************************
..start:
	call	f386api_init		;API初期化処理
	jmp	f386api_return		;復帰処理

;------------------------------------------------------------------------------
;●未対応ファンクション
;------------------------------------------------------------------------------
	align	4
F386API_00h:
F386API_01h:
F386API_02h:
F386API_03h:
F386API_04h:
F386API_05h:
F386API_06h:
F386API_07h:

F386API_0ah:
F386API_0bh:
F386API_0ch:
F386API_0dh:
F386API_0eh:
F386API_0fh:
	set_cy		;エラー。Cy でなく eax に返してもよい
	iretd


;------------------------------------------------------------------------------
;●ファンクション 08h
;------------------------------------------------------------------------------
	align	4
F386API_08h:
	push	eax
	push	edx
	push	ds

	mov	ds,[cs:my_ds]		;ds ロード
	mov	edx,offset MES08h
	mov	 ah,09h			;文字列出力
	int	21h

	pop	ds
	pop	edx
	pop	eax
	iretd


;------------------------------------------------------------------------------
;●ファンクション 09h
;------------------------------------------------------------------------------
	align	4
F386API_09h:
	push	eax
	push	edx
	push	ds

	mov	ds,[cs:my_ds]		;ds ロード
	mov	edx,offset MES09h
	mov	 ah,09h			;文字列出力
	int	21h

	pop	ds
	pop	edx
	pop	eax
	iretd


;------------------------------------------------------------------------------
;●未知のファンクション
;------------------------------------------------------------------------------
	align	4
F386API_dummy:		;未知のファンクション
	set_cy		;Cy =1
	iretd


;------------------------------------------------------------------------------
;------------------------------------------------------------------------------



data	segment public 'DATA' use32
;------------------------------------------------------------------------------
;------------------------------------------------------------------------------
func_table:
	;### function 00h-07h ######
	dd	offset F386API_00h
	dd	offset F386API_01h
	dd	offset F386API_02h
	dd	offset F386API_03h
	dd	offset F386API_04h
	dd	offset F386API_05h
	dd	offset F386API_06h
	dd	offset F386API_07h


	;### function 08h-0fh ######
	dd	offset F386API_08h
	dd	offset F386API_09h
	dd	offset F386API_0ah
	dd	offset F386API_0bh
	dd	offset F386API_0ch
	dd	offset F386API_0dh
	dd	offset F386API_0eh
	dd	offset F386API_0fh

%rep 0f0h
	dd	offset F386API_dummy	;ダミー
%endrep

MES08h	db	'Function 08h',13,10,'$'
MES09h	db	'Function 09h',13,10,'$'


;------------------------------------------------------------------------------
;------------------------------------------------------------------------------
	end
